docs/tutorial/tips_and_tricks.org
#+TITLE: Tips & Tricks
#+AUTHOR: Anton Sol

#+SETUPFILE: ../utils.org

**** layout for the 'tree' btreemap
#+BEGIN_SRC bash :session cli0 :exports code 
  lk --private watch --bare --mode ${2:-tree-desc} --no-new --write "stdout-expr:[group:str] [domain:str] [path_len:str] [path:str] [pubkey:str] :: { [create:str] [hash:str] [recv:str] }"
#+END_SRC

**** dot graph 

#+BEGIN_SRC bash :session cli0 :exports code 
  lk --private watch --bare --mode ${2:-tree-desc} --no-new --write "stdout-expr:[group:str] [domain:str] [path_len:str] [path:str] [pubkey:str] :: { [create:str] [hash:str] [recv:str] }"
#+END_SRC


**** Reading/Writing large files

#+BEGIN_SRC bash :session cli0 :exports code 
export FILE=$2
export CHAN=${3:-default}
export IN=${4:-$FILE}
cat "$IN" | lk data | lk --env collect blobs:$LK_GROUP:/[env:CHAN]/[env:FILE] --write db --forward db
#+END_SRC

#+BEGIN_SRC bash :session cli0 :exports code 
export FILE=$2
export CHAN=${3:-default}
export OUT=${4:-$FILE}
lk --env watch "blobs:$LK_GROUP:/[env:CHAN]/[env:FILE]" --max 1 | \
     lk --env get-links -R --forward null --write "file-expr:[env:OUT]:[data]" pause
      ;;
#+END_SRC




**** A poor man's REPL 

#+BEGIN_SRC bash :session cli0 :exports code 
  lk eval [argv:-1] argv -D'\n' --data-eval --data-stdin 
#+END_SRC

Each read goes into argv, which is added to the context of each read.

#+BEGIN_SRC bash :session cli0 :exports code 
  hello
  [0] world
  The value of \[1\] = [1]
  # press Ctrl-d to close stdin
#+END_SRC

prints ~The value of [1] = hello world~

# add video streaming example

**** Single thread performance:

FIXME: The debug build is significant slower - especially for keypoint:

#+BEGIN_SRC bash :session cli0 :exports both :results output verbatim
  lscpu | grep "Model name"
  lk --version
  echo Datapoints
  lk data --data /dev/zero --data-reads 10000 | pv > /dev/null
  echo Linkpoints  
  lk link :: --data-reads 10000 --create-int 0 --multi --data /dev/zero | pv > /dev/null
  echo keypoints
  lk keypoint :: --password "my secret" --data-reads 1000 --create-int 0 --multi --data /dev/zero | pv > /dev/null
#+END_SRC

